---
kind: method
id: M:Autodesk.Revit.DB.TessellatedFace.Dispose
source: html/1a63ad2e-0958-eebf-c8bd-ef3cf4fdd5f1.htm
---
# Autodesk.Revit.DB.TessellatedFace.Dispose Method

Releases all resources used by the TessellatedFace

## Syntax (C#)
```csharp
public void Dispose()
```